#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.sftp.data.aws_iam_policy_document.transfer_server_readonly_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "transfer_server_readonly_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sftp.data.aws_iam_policy_document.transfer_server_write_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "transfer_server_write_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:DeleteObjectVersion",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sftp.aws_iam_policy.replication will be created
  + resource "aws_iam_policy" "replication" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.sftp.aws_iam_role.replication will be created
  + resource "aws_iam_role" "replication" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role.transfer_server_readonly_role will be created
  + resource "aws_iam_role" "transfer_server_readonly_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role.transfer_server_role will be created
  + resource "aws_iam_role" "transfer_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role.transfer_server_write_role will be created
  + resource "aws_iam_role" "transfer_server_write_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role_policy.transfer_server_readonly_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_readonly_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.sftp.aws_iam_role_policy.transfer_server_to_cloudwatch_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_to_cloudwatch_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.sftp.aws_iam_role_policy.transfer_server_write_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_write_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.sftp.aws_s3_bucket.target_storage_bucket will be created
  + resource "aws_s3_bucket" "target_storage_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.sftp.aws_s3_bucket.transfer_server_bucket will be created
  + resource "aws_s3_bucket" "transfer_server_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "true"
        }
      + tags_all                    = {
          + "Terraform" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + status = "Enabled"

              + destination {
                  + bucket        = (known after apply)
                  + storage_class = "STANDARD"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.sftp.aws_s3_bucket_public_access_block.target_storage_bucket_block will be created
  + resource "aws_s3_bucket_public_access_block" "target_storage_bucket_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.sftp.aws_s3_bucket_public_access_block.transfer_server_bucket_block will be created
  + resource "aws_s3_bucket_public_access_block" "transfer_server_bucket_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.sftp.aws_transfer_server.transfer_server[0] will be created
  + resource "aws_transfer_server" "transfer_server" {
      + arn                    = (known after apply)
      + domain                 = "S3"
      + endpoint               = (known after apply)
      + endpoint_type          = "PUBLIC"
      + force_destroy          = false
      + host_key_fingerprint   = (known after apply)
      + id                     = (known after apply)
      + identity_provider_type = "SERVICE_MANAGED"
      + logging_role           = (known after apply)
      + protocols              = [
          + "SFTP",
        ]
      + security_policy_name   = "TransferSecurityPolicy-2018-11"
      + tags                   = {
          + "Terrafrom" = "true"
        }
      + tags_all               = {
          + "Terrafrom" = "true"
        }
    }

  # module.sftp.random_id.aws_s3_bucket_transfer_server will be created
  + resource "random_id" "aws_s3_bucket_transfer_server" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.sftp.random_string.iam_role_random_suffix will be created
  + resource "random_string" "iam_role_random_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + target_storage_bucket_arn    = (known after apply)
  + target_storage_bucket_name   = (known after apply)
  + transfer_server_arn          = (known after apply)
  + transfer_server_endpoint     = (known after apply)
  + transfer_server_id           = (known after apply)
  + transfer_storage_bucket_arn  = (known after apply)
  + transfer_storage_bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @JoseFMP, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*